//预加载图片
function preloadPic(src,callback){
      var image = new Image();
      if(!!window.ActiveXObject){
        //兼容IE
        image.onreadystatechange = function(){
          if(this.readyState == "complete"){
            callback();
          }
        };
      }else{
        image.onload = function(){
            callback();
        };
      }
      image.src = src;
}

/*************************************************/
/*************************************************/
/*************       正则部分        *************/
/*************************************************/
/*************************************************/


/*************************************************/
/*****    判断输入的字符串是否为IP地址      ******/
/*************************************************/
function isIP(str){
      var patt = /^(\d{1,3})\.(\d{1,3})\.(\d{1,3})\.(\d{1,3})$/;
      var result;
      var index = 1;
      var temp = 0;

      if((result = str.match(patt))){  //是否能够匹配，xxx.xxx.xxx.xxx格式，第一次判断
        console.log(result);
        while(index <= 4){
          console.log(result[index]);
          temp = parseInt(result[index]);
          if((temp >= 255) || (temp <0 )){
            return false;     //每个数字是否大于等于0小于等于255，第二重判断
          }
          if(index === 4){
            return true;     //进过两重判断，后得出是真正的IP地址
          }

          index += 1;
        }
      }
      return false;
}

/*************************************************/
/*****    判断输入的字符串是否为空          ******/
/*-----------------------------------------------*/
/*   输入为空和都是空格、制表符和换行符判断为空  */
/*************************************************/
function isBlank(str){
  if(str === ""){
    return true;  //第一重判断，是否为空
  }

  var patt = /^\s+$/;

  if(patt.test(str)){
    return true;  //第二重判断，是否所有的都是空格、制表符和换行符 
  }

  return false;

}
/*************************************************/
/*****    判断输入的字符串是否为中文        ******/
/*-----------------------------------------------*/
/*        不能包含空格和各种标点符号             */
/*************************************************/
function isChinese(str){
  var patt = /^[\u4E00-\u9FA5]+$/;
  if(patt.test(str)){
    return true;
  }

  return false;
}
/*************************************************/
/*****    判断输入的字符串是否为邮箱        ******/
/*-----------------------------------------------*/
/*  由大小写字母，数字，中横线，下划线组成       */
/*  如果需要汉字，则在@前面加上\u4E00-\u9FA5     */
/*************************************************/
function isEmail(str){
  var patt = /^[a-zA-Z0-9-_]+@[a-zA-Z0-9-_]+(\.[a-zA-Z0-9-_]+)+$/;
  if(patt.test(str)){
    return true;
  }
  return false;
}
/*************************************************/
/*****  判断输入的字符串是否为合法的密码    ******/
/*-----------------------------------------------*/
/*        密码只允许由ascii组成[\x00-\x7f]       */
/*密码长度可以根据输入的后两位变量决定,默认6<x<17*/
/*************************************************/
function isValidPasswd(str,minLen,maxLen){
  var patt = /^[\x00-\x7f]+$/;
  if(!patt.test(str)){
    return false;
  }
  minLen = minLen || 6;
  maxLen = maxLen || 17;
  if((str.length > maxLen) || (str.length < minLen)){
    return false;
  }
  return true;
}
/*************************************************/
/*****    判断输入的字符串是否为整数        ******/
/*-----------------------------------------------*/
/*判断是否为正整数和负整数，输入可为字符串或数字 */
/*************************************************/
function isInt(str){
  str = str + ""; //转为字符串
  var patt = /^-?[0-9]+$/;
  if(patt.test(str)){
    return true;
  } 
  return false;
}
/*************************************************/
/*****    判断输入的字符串是否为网址        ******/
/*-----------------------------------------------*/
/* */
/*************************************************/
function isURL(){

}
^((https|http|ftp|rtsp|mms)?:\/\/)?(([0-9a-z_!~*'().&=+$%-]+: )?[0-9a-z_!~*'().&=+$%-]+@)? 
    (([0-9]{1,3}\.){3}[0-9]{1,3}      
    |      
    ([0-9a-z_!~*'()-]+\.)*       
    ([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]\.        
    [a-z]{2,6})         
    (:[0-9]{1,4})?        
    ((/?)| 
    (/[0-9a-z_!~*'().;?:@&=+$,%#-]+)+/?)$